#### Terraform Validation & Plan Results
* Terraform Version 📎`1.9.6`
* Working Directory 📂`./code/infra`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
[0m[1mdata.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mdata.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.key_vault.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mazurerm_resource_group.resource_group: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/shir-dev-shir-rg][0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.key_vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lNWRmNjg0My1lYmRlLTRkNzktOWM3ZS03NDMxYTNjZDQzZDI7b2JqZWN0SWQ9OTczZGYyYWQtNGU1ZS00ZThiLTlkZjYtMTdmNjFlOWVmZDU1O3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001][0m
[0m[1mazurerm_data_factory.data_factory: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/shir-dev-shir-rg/providers/Microsoft.DataFactory/factories/shir-dev-adf001][0m
[0m[1mmodule.user_assigned_identity.azurerm_user_assigned_identity.user_assigned_identity: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/shir-dev-shir-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/shir-dev-uai001][0m
[0m[1mmodule.app_service_plan.azurerm_service_plan.service_plan: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/shir-dev-shir-rg/providers/Microsoft.Web/serverFarms/shir-dev-asp001][0m
[0m[1mmodule.key_vault.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/shir-dev-shir-rg/providers/Microsoft.KeyVault/vaults/shir-dev-kv001][0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/networkSecurityGroups/ptt-dev-default-nsg001][0m
[0m[1mdata.azurerm_route_table.route_table: Read complete after 1s [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/routeTables/ptt-dev-default-rt001][0m
[0m[1mazapi_resource.subnet_container: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/ContainerSubnet][0m
[0m[1mmodule.app_service_plan.azurerm_monitor_diagnostic_setting.diagnostic_setting_service_plan["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/shir-dev-shir-rg/providers/Microsoft.Web/serverFarms/shir-dev-asp001|applicationLogs-0][0m
[0m[1mdata.azurerm_log_analytics_workspace.log_analytics_workspace: Reading...[0m[0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_data_factory: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/shir-dev-shir-rg/providers/Microsoft.DataFactory/factories/shir-dev-adf001|logAnalytics][0m
[0m[1mdata.azurerm_log_analytics_workspace.log_analytics_workspace: Read complete after 1s [id=/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001][0m
[0m[1mazapi_resource.subnet_private_endpoints: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/PrivateEndpointSubnet][0m
[0m[1mazurerm_private_endpoint.data_factory_private_endpoint: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/shir-dev-shir-rg/providers/Microsoft.Network/privateEndpoints/shir-dev-adf001-pe][0m
[0m[1mazurerm_role_assignment.uai_role_assignment_key_vault_secrets_user: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/shir-dev-shir-rg/providers/Microsoft.KeyVault/vaults/shir-dev-kv001/providers/Microsoft.Authorization/roleAssignments/a15b2174-f001-58a1-b733-7d41ba386662][0m
[0m[1mmodule.key_vault.azurerm_role_assignment.current_roleassignment_key_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/shir-dev-shir-rg/providers/Microsoft.KeyVault/vaults/shir-dev-kv001/providers/Microsoft.Authorization/roleAssignments/3e80a800-0f2d-5370-705a-ecf55b143305][0m
[0m[1mmodule.key_vault.azurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault["0"]: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/shir-dev-shir-rg/providers/Microsoft.KeyVault/vaults/shir-dev-kv001|applicationLogs-0][0m
[0m[1mmodule.key_vault.azurerm_private_endpoint.private_endpoint_cognitive_account_vault: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/shir-dev-shir-rg/providers/Microsoft.Network/privateEndpoints/shir-dev-kv001-vault-pe][0m
[0m[1mazurerm_data_factory_integration_runtime_self_hosted.data_factory_integration_runtime_self_hosted: Refreshing state... [id=/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/shir-dev-shir-rg/providers/Microsoft.DataFactory/factories/shir-dev-adf001/integrationruntimes/SelfhostedIntegrationRuntime001][0m
[0m[1mmodule.key_vault.time_sleep.sleep_connectivity: Refreshing state... [id=2024-09-30T08:28:27Z][0m
[0m[1mazurerm_key_vault_secret.key_vault_secret_shir_key: Refreshing state... [id=https://shir-dev-kv001.vault.azure.net/secrets/datafactory-shir-auth-key/2c7d16b9388f4c25967bc7f9096c3e21][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
[31m-[0m/[32m+[0m destroy and then create replacement[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_data_factory[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_data_factory" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_windows_web_app[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_windows_web_app" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # azurerm_data_factory.data_factory[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_data_factory" "data_factory" {
      [33m~[0m[0m id                               = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/shir-dev-shir-rg/providers/Microsoft.DataFactory/factories/shir-dev-adf001" -> (known after apply)
      [33m~[0m[0m name                             = "shir-dev-adf001" [33m->[0m[0m "myshir-dev-adf001" [31m# forces replacement[0m[0m
      [33m~[0m[0m resource_group_name              = "shir-dev-shir-rg" [33m->[0m[0m "myshir-dev-shir-rg" [31m# forces replacement[0m[0m
        tags                             = {
            "workload" = "shir-runners"
        }
        [90m# (6 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m identity {
          [31m-[0m[0m identity_ids = [] [90m-> null[0m[0m
          [33m~[0m[0m principal_id = "d789ea80-8a85-4dae-bb49-4c01eb8f72fe" -> (known after apply)
          [33m~[0m[0m tenant_id    = "37963dd4-f4e6-40f8-a7d6-24b97919e452" -> (known after apply)
            [90m# (1 unchanged attribute hidden)[0m[0m
        }
    }

[1m  # azurerm_data_factory_integration_runtime_self_hosted.data_factory_integration_runtime_self_hosted[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_data_factory_integration_runtime_self_hosted" "data_factory_integration_runtime_self_hosted" {
      [33m~[0m[0m data_factory_id                              = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/shir-dev-shir-rg/providers/Microsoft.DataFactory/factories/shir-dev-adf001" -> (known after apply) [31m# forces replacement[0m[0m
      [33m~[0m[0m id                                           = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/shir-dev-shir-rg/providers/Microsoft.DataFactory/factories/shir-dev-adf001/integrationruntimes/SelfhostedIntegrationRuntime001" -> (known after apply)
        name                                         = "SelfhostedIntegrationRuntime001"
      [33m~[0m[0m primary_authorization_key                    = "IR@f2be68c9-adf8-4ca5-8ece-6910ec811435@shir-dev-adf001@ServiceEndpoint=shir-dev-adf001.northeurope.datafactory.azure.net@7HmMiq9fzBBEeQpf3QTZldCjJS79hpJqaiRIEKDPzy0=" -> (known after apply)
      [33m~[0m[0m secondary_authorization_key                  = "IR@f2be68c9-adf8-4ca5-8ece-6910ec811435@shir-dev-adf001@ServiceEndpoint=shir-dev-adf001.northeurope.datafactory.azure.net@IExyEXiXigfwidhOsaPVeyUw0NmfZ+1zDVzFDNk1ueU=" -> (known after apply)
      [31m-[0m[0m self_contained_interactive_authoring_enabled = false [90m-> null[0m[0m
        [90m# (1 unchanged attribute hidden)[0m[0m
    }

[1m  # azurerm_key_vault_secret.key_vault_secret_shir_key[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_key_vault_secret" "key_vault_secret_shir_key" {
      [33m~[0m[0m id                      = "https://shir-dev-kv001.vault.azure.net/secrets/datafactory-shir-auth-key/2c7d16b9388f4c25967bc7f9096c3e21" -> (known after apply)
      [33m~[0m[0m key_vault_id            = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/shir-dev-shir-rg/providers/Microsoft.KeyVault/vaults/shir-dev-kv001" -> (known after apply) [31m# forces replacement[0m[0m
        name                    = "datafactory-shir-auth-key"
      [33m~[0m[0m resource_id             = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/shir-dev-shir-rg/providers/Microsoft.KeyVault/vaults/shir-dev-kv001/secrets/datafactory-shir-auth-key/versions/2c7d16b9388f4c25967bc7f9096c3e21" -> (known after apply)
      [33m~[0m[0m resource_versionless_id = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/shir-dev-shir-rg/providers/Microsoft.KeyVault/vaults/shir-dev-kv001/secrets/datafactory-shir-auth-key" -> (known after apply)
      [31m-[0m[0m tags                    = {} [90m-> null[0m[0m
      [33m~[0m[0m value                   = (sensitive value)
      [33m~[0m[0m version                 = "2c7d16b9388f4c25967bc7f9096c3e21" -> (known after apply)
      [33m~[0m[0m versionless_id          = "https://shir-dev-kv001.vault.azure.net/secrets/datafactory-shir-auth-key" -> (known after apply)
        [90m# (1 unchanged attribute hidden)[0m[0m
    }

[1m  # azurerm_monitor_diagnostic_setting.diagnostic_setting_data_factory[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_data_factory" {
      [33m~[0m[0m id                             = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/shir-dev-shir-rg/providers/Microsoft.DataFactory/factories/shir-dev-adf001|logAnalytics" -> (known after apply)
      [33m~[0m[0m log_analytics_destination_type = "AzureDiagnostics" -> (known after apply)
        name                           = "logAnalytics"
      [33m~[0m[0m target_resource_id             = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/shir-dev-shir-rg/providers/Microsoft.DataFactory/factories/shir-dev-adf001" -> (known after apply) [31m# forces replacement[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m enabled_log (known after apply)
      [31m-[0m[0m enabled_log {
          [31m-[0m[0m category_group = "allLogs" [90m-> null[0m[0m
            [90m# (1 unchanged attribute hidden)[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }

      [33m~[0m[0m metric (known after apply)
      [31m-[0m[0m metric {
          [31m-[0m[0m category = "AllMetrics" [90m-> null[0m[0m
          [31m-[0m[0m enabled  = true [90m-> null[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }
    }

[1m  # azurerm_monitor_diagnostic_setting.diagnostic_setting_windows_web_app[0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_windows_web_app" {
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
      [32m+[0m[0m log_analytics_workspace_id     = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001"
      [32m+[0m[0m name                           = "logAnalytics"
      [32m+[0m[0m target_resource_id             = (known after apply)

      [32m+[0m[0m enabled_log (known after apply)

      [32m+[0m[0m metric (known after apply)
    }

[1m  # azurerm_private_endpoint.data_factory_private_endpoint[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "data_factory_private_endpoint" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m custom_network_interface_name = "shir-dev-adf001-nic" [33m->[0m[0m "myshir-dev-adf001-nic" [31m# forces replacement[0m[0m
      [33m~[0m[0m id                            = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/shir-dev-shir-rg/providers/Microsoft.Network/privateEndpoints/shir-dev-adf001-pe" -> (known after apply)
      [33m~[0m[0m name                          = "shir-dev-adf001-pe" [33m->[0m[0m "myshir-dev-adf001-pe" [31m# forces replacement[0m[0m
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/shir-dev-shir-rg/providers/Microsoft.Network/networkInterfaces/shir-dev-adf001-nic"
              [31m-[0m[0m name = "shir-dev-adf001-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/shir-dev-shir-rg/providers/Microsoft.Network/privateEndpoints/shir-dev-adf001-pe/privateDnsZoneGroups/shir-dev-adf001-arecord/privateDnsZoneConfigs/privatelink.datafactory.azure.net"
              [31m-[0m[0m name                = "privatelink.datafactory.azure.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.datafactory.azure.net"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "shir-dev-adf001.northeurope.privatelink.datafactory.azure.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.3.0.133",
                        ]
                      [31m-[0m[0m name         = "shir-dev-adf001.northeurope"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      [33m~[0m[0m resource_group_name           = "shir-dev-shir-rg" [33m->[0m[0m "myshir-dev-shir-rg" [31m# forces replacement[0m[0m
        tags                          = {
            "workload" = "shir-runners"
        }
        [90m# (2 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/shir-dev-shir-rg/providers/Microsoft.Network/privateEndpoints/shir-dev-adf001-pe/privateDnsZoneGroups/shir-dev-adf001-arecord" -> (known after apply)
          [33m~[0m[0m name                 = "shir-dev-adf001-arecord" [33m->[0m[0m "myshir-dev-adf001-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
          [33m~[0m[0m name                              = "shir-dev-adf001-pe" [33m->[0m[0m "myshir-dev-adf001-pe" [31m# forces replacement[0m[0m
          [33m~[0m[0m private_connection_resource_id    = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/shir-dev-shir-rg/providers/Microsoft.DataFactory/factories/shir-dev-adf001" -> (known after apply) [31m# forces replacement[0m[0m
          [33m~[0m[0m private_ip_address                = "10.3.0.133" -> (known after apply)
            [90m# (4 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # azurerm_private_endpoint.windows_web_app_private_endpoint[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "windows_web_app_private_endpoint" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "myshir-dev-asp001-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "myshir-dev-asp001-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "myshir-dev-shir-rg"
      [32m+[0m[0m subnet_id                     = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/PrivateEndpointSubnet"
      [32m+[0m[0m tags                          = {
          [32m+[0m[0m "workload" = "shir-runners"
        }

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "myshir-dev-asp001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "myshir-dev-asp001-pe"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "sites",
            ]
        }
    }

[1m  # azurerm_resource_group.resource_group[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_resource_group" "resource_group" {
      [33m~[0m[0m id         = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/shir-dev-shir-rg" -> (known after apply)
      [33m~[0m[0m name       = "shir-dev-shir-rg" [33m->[0m[0m "myshir-dev-shir-rg" [31m# forces replacement[0m[0m
        tags       = {
            "workload" = "shir-runners"
        }
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[1m  # azurerm_role_assignment.uai_role_assignment_key_vault_secrets_user[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_role_assignment" "uai_role_assignment_key_vault_secrets_user" {
      [33m~[0m[0m id                                     = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/shir-dev-shir-rg/providers/Microsoft.KeyVault/vaults/shir-dev-kv001/providers/Microsoft.Authorization/roleAssignments/a15b2174-f001-58a1-b733-7d41ba386662" -> (known after apply)
      [33m~[0m[0m name                                   = "a15b2174-f001-58a1-b733-7d41ba386662" -> (known after apply)
      [33m~[0m[0m principal_id                           = "a5a97df9-28c8-4c8d-a2cf-7a6af54b6f1c" -> (known after apply) [31m# forces replacement[0m[0m
      [33m~[0m[0m role_definition_id                     = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> (known after apply)
      [33m~[0m[0m scope                                  = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/shir-dev-shir-rg/providers/Microsoft.KeyVault/vaults/shir-dev-kv001" -> (known after apply) [31m# forces replacement[0m[0m
      [32m+[0m[0m skip_service_principal_aad_check       = (known after apply)
        [90m# (6 unchanged attributes hidden)[0m[0m
    }

[1m  # azurerm_windows_web_app.windows_web_app[0m will be created
[0m  [32m+[0m[0m resource "azurerm_windows_web_app" "windows_web_app" {
      [32m+[0m[0m app_settings                                   = (known after apply)
      [32m+[0m[0m client_affinity_enabled                        = false
      [32m+[0m[0m client_certificate_enabled                     = false
      [32m+[0m[0m client_certificate_mode                        = "Required"
      [32m+[0m[0m custom_domain_verification_id                  = (sensitive value)
      [32m+[0m[0m default_hostname                               = (known after apply)
      [32m+[0m[0m enabled                                        = true
      [32m+[0m[0m ftp_publish_basic_authentication_enabled       = false
      [32m+[0m[0m hosting_environment_id                         = (known after apply)
      [32m+[0m[0m https_only                                     = true
      [32m+[0m[0m id                                             = (known after apply)
      [32m+[0m[0m key_vault_reference_identity_id                = (known after apply)
      [32m+[0m[0m kind                                           = (known after apply)
      [32m+[0m[0m location                                       = "northeurope"
      [32m+[0m[0m name                                           = "myshir-dev-asp001"
      [32m+[0m[0m outbound_ip_address_list                       = (known after apply)
      [32m+[0m[0m outbound_ip_addresses                          = (known after apply)
      [32m+[0m[0m possible_outbound_ip_address_list              = (known after apply)
      [32m+[0m[0m possible_outbound_ip_addresses                 = (known after apply)
      [32m+[0m[0m public_network_access_enabled                  = false
      [32m+[0m[0m resource_group_name                            = "myshir-dev-shir-rg"
      [32m+[0m[0m service_plan_id                                = (known after apply)
      [32m+[0m[0m site_credential                                = (sensitive value)
      [32m+[0m[0m tags                                           = {
          [32m+[0m[0m "workload" = "shir-runners"
        }
      [32m+[0m[0m virtual_network_subnet_id                      = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/ContainerSubnet"
      [32m+[0m[0m webdeploy_publish_basic_authentication_enabled = false
      [32m+[0m[0m zip_deploy_file                                = (known after apply)
        [90m# (1 unchanged attribute hidden)[0m[0m

      [32m+[0m[0m identity {
          [32m+[0m[0m identity_ids = (known after apply)
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "SystemAssigned, UserAssigned"
        }

      [32m+[0m[0m site_config {
          [32m+[0m[0m always_on                                     = true
          [32m+[0m[0m container_registry_managed_identity_client_id = (known after apply)
          [32m+[0m[0m container_registry_use_managed_identity       = true
          [32m+[0m[0m default_documents                             = (known after apply)
          [32m+[0m[0m detailed_error_logging_enabled                = (known after apply)
          [32m+[0m[0m ftps_state                                    = "Disabled"
          [32m+[0m[0m http2_enabled                                 = true
          [32m+[0m[0m ip_restriction_default_action                 = "Allow"
          [32m+[0m[0m linux_fx_version                              = (known after apply)
          [32m+[0m[0m load_balancing_mode                           = "LeastRequests"
          [32m+[0m[0m local_mysql_enabled                           = false
          [32m+[0m[0m managed_pipeline_mode                         = "Integrated"
          [32m+[0m[0m minimum_tls_version                           = "1.2"
          [32m+[0m[0m remote_debugging_enabled                      = false
          [32m+[0m[0m remote_debugging_version                      = "VS2022"
          [32m+[0m[0m scm_ip_restriction_default_action             = "Allow"
          [32m+[0m[0m scm_minimum_tls_version                       = "1.2"
          [32m+[0m[0m scm_type                                      = (known after apply)
          [32m+[0m[0m scm_use_main_ip_restriction                   = false
          [32m+[0m[0m use_32_bit_worker                             = true
          [32m+[0m[0m vnet_route_all_enabled                        = true
          [32m+[0m[0m websockets_enabled                            = false
          [32m+[0m[0m windows_fx_version                            = (known after apply)
          [32m+[0m[0m worker_count                                  = (known after apply)

          [32m+[0m[0m application_stack {
              [32m+[0m[0m current_stack                = (known after apply)
              [32m+[0m[0m docker_image_name            = (sensitive value)
              [32m+[0m[0m docker_registry_url          = (sensitive value)
              [32m+[0m[0m dotnet_version               = (known after apply)
              [32m+[0m[0m java_embedded_server_enabled = (known after apply)
              [32m+[0m[0m php_version                  = (known after apply)
              [32m+[0m[0m python                       = false
            }
        }
    }

[1m  # module.app_service_plan.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_service_plan[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_service_plan" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.app_service_plan.azurerm_monitor_diagnostic_setting.diagnostic_setting_service_plan["0"][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_service_plan" {
      [33m~[0m[0m id                             = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/shir-dev-shir-rg/providers/Microsoft.Web/serverFarms/shir-dev-asp001|applicationLogs-0" -> (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
        name                           = "applicationLogs-0"
      [33m~[0m[0m target_resource_id             = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/shir-dev-shir-rg/providers/Microsoft.Web/serverFarms/shir-dev-asp001" -> (known after apply) [31m# forces replacement[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m enabled_log (known after apply)

      [33m~[0m[0m metric (known after apply)
      [31m-[0m[0m metric {
          [31m-[0m[0m category = "AllMetrics" [90m-> null[0m[0m
          [31m-[0m[0m enabled  = true [90m-> null[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }
    }

[1m  # module.app_service_plan.azurerm_service_plan.service_plan[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_service_plan" "service_plan" {
      [33m~[0m[0m id                           = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/shir-dev-shir-rg/providers/Microsoft.Web/serverFarms/shir-dev-asp001" -> (known after apply)
      [33m~[0m[0m kind                         = "windows" -> (known after apply)
      [33m~[0m[0m maximum_elastic_worker_count = 1 -> (known after apply)
      [33m~[0m[0m name                         = "shir-dev-asp001" [33m->[0m[0m "myshir-dev-asp001" [31m# forces replacement[0m[0m
      [33m~[0m[0m reserved                     = false -> (known after apply)
      [33m~[0m[0m resource_group_name          = "shir-dev-shir-rg" [33m->[0m[0m "myshir-dev-shir-rg" [31m# forces replacement[0m[0m
        tags                         = {
            "workload" = "shir-runners"
        }
        [90m# (7 unchanged attributes hidden)[0m[0m
    }

[1m  # module.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_key_vault" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.key_vault.azurerm_key_vault.key_vault[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_key_vault" "key_vault" {
      [33m~[0m[0m id                              = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/shir-dev-shir-rg/providers/Microsoft.KeyVault/vaults/shir-dev-kv001" -> (known after apply)
      [33m~[0m[0m name                            = "shir-dev-kv001" [33m->[0m[0m "myshir-dev-kv001" [31m# forces replacement[0m[0m
      [33m~[0m[0m resource_group_name             = "shir-dev-shir-rg" [33m->[0m[0m "myshir-dev-shir-rg" [31m# forces replacement[0m[0m
        tags                            = {
            "workload" = "shir-runners"
        }
      [33m~[0m[0m vault_uri                       = "https://shir-dev-kv001.vault.azure.net/" -> (known after apply)
        [90m# (11 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m contact (known after apply)

      [33m~[0m[0m network_acls {
          [31m-[0m[0m ip_rules                   = [] [90m-> null[0m[0m
          [31m-[0m[0m virtual_network_subnet_ids = [] [90m-> null[0m[0m
            [90m# (2 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.key_vault.azurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault["0"][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_key_vault" {
      [33m~[0m[0m id                             = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/shir-dev-shir-rg/providers/Microsoft.KeyVault/vaults/shir-dev-kv001|applicationLogs-0" -> (known after apply)
      [33m~[0m[0m log_analytics_destination_type = "AzureDiagnostics" -> (known after apply)
        name                           = "applicationLogs-0"
      [33m~[0m[0m target_resource_id             = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/shir-dev-shir-rg/providers/Microsoft.KeyVault/vaults/shir-dev-kv001" -> (known after apply) [31m# forces replacement[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m enabled_log (known after apply)
      [31m-[0m[0m enabled_log {
          [31m-[0m[0m category_group = "allLogs" [90m-> null[0m[0m
            [90m# (1 unchanged attribute hidden)[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }
      [31m-[0m[0m enabled_log {
          [31m-[0m[0m category_group = "audit" [90m-> null[0m[0m
            [90m# (1 unchanged attribute hidden)[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }

      [33m~[0m[0m metric (known after apply)
      [31m-[0m[0m metric {
          [31m-[0m[0m category = "AllMetrics" [90m-> null[0m[0m
          [31m-[0m[0m enabled  = true [90m-> null[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }
    }

[1m  # module.key_vault.azurerm_private_endpoint.private_endpoint_cognitive_account_vault[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_cognitive_account_vault" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m custom_network_interface_name = "shir-dev-kv001-vault-nic" [33m->[0m[0m "myshir-dev-kv001-vault-nic" [31m# forces replacement[0m[0m
      [33m~[0m[0m id                            = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/shir-dev-shir-rg/providers/Microsoft.Network/privateEndpoints/shir-dev-kv001-vault-pe" -> (known after apply)
      [33m~[0m[0m name                          = "shir-dev-kv001-vault-pe" [33m->[0m[0m "myshir-dev-kv001-vault-pe" [31m# forces replacement[0m[0m
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/shir-dev-shir-rg/providers/Microsoft.Network/networkInterfaces/shir-dev-kv001-vault-nic"
              [31m-[0m[0m name = "shir-dev-kv001-vault-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/shir-dev-shir-rg/providers/Microsoft.Network/privateEndpoints/shir-dev-kv001-vault-pe/privateDnsZoneGroups/shir-dev-kv001-arecord/privateDnsZoneConfigs/privatelink.vaultcore.azure.net"
              [31m-[0m[0m name                = "privatelink.vaultcore.azure.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "shir-dev-kv001.privatelink.vaultcore.azure.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.3.0.132",
                        ]
                      [31m-[0m[0m name         = "shir-dev-kv001"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      [33m~[0m[0m resource_group_name           = "shir-dev-shir-rg" [33m->[0m[0m "myshir-dev-shir-rg" [31m# forces replacement[0m[0m
        tags                          = {
            "workload" = "shir-runners"
        }
        [90m# (2 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/shir-dev-shir-rg/providers/Microsoft.Network/privateEndpoints/shir-dev-kv001-vault-pe/privateDnsZoneGroups/shir-dev-kv001-arecord" -> (known after apply)
          [33m~[0m[0m name                 = "shir-dev-kv001-arecord" [33m->[0m[0m "myshir-dev-kv001-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
          [33m~[0m[0m name                              = "shir-dev-kv001-vault-svc" [33m->[0m[0m "myshir-dev-kv001-vault-svc" [31m# forces replacement[0m[0m
          [33m~[0m[0m private_connection_resource_id    = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/shir-dev-shir-rg/providers/Microsoft.KeyVault/vaults/shir-dev-kv001" -> (known after apply) [31m# forces replacement[0m[0m
          [33m~[0m[0m private_ip_address                = "10.3.0.132" -> (known after apply)
            [90m# (4 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.key_vault.azurerm_role_assignment.current_roleassignment_key_vault[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_role_assignment" "current_roleassignment_key_vault" {
      [33m~[0m[0m id                                     = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/shir-dev-shir-rg/providers/Microsoft.KeyVault/vaults/shir-dev-kv001/providers/Microsoft.Authorization/roleAssignments/3e80a800-0f2d-5370-705a-ecf55b143305" -> (known after apply)
      [33m~[0m[0m name                                   = "3e80a800-0f2d-5370-705a-ecf55b143305" -> (known after apply)
      [33m~[0m[0m principal_type                         = "ServicePrincipal" -> (known after apply)
      [33m~[0m[0m role_definition_id                     = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/providers/Microsoft.Authorization/roleDefinitions/00482a5a-887f-4fb3-b363-3b7fe8e74483" -> (known after apply)
      [33m~[0m[0m scope                                  = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/shir-dev-shir-rg/providers/Microsoft.KeyVault/vaults/shir-dev-kv001" -> (known after apply) [31m# forces replacement[0m[0m
      [32m+[0m[0m skip_service_principal_aad_check       = (known after apply)
        [90m# (6 unchanged attributes hidden)[0m[0m
    }

[1m  # module.user_assigned_identity.azurerm_user_assigned_identity.user_assigned_identity[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_user_assigned_identity" "user_assigned_identity" {
      [33m~[0m[0m client_id           = "5a8ee8da-06b9-4b31-9373-032b7c5e7d6c" -> (known after apply)
      [33m~[0m[0m id                  = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/shir-dev-shir-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/shir-dev-uai001" -> (known after apply)
      [33m~[0m[0m name                = "shir-dev-uai001" [33m->[0m[0m "myshir-dev-uai001" [31m# forces replacement[0m[0m
      [33m~[0m[0m principal_id        = "a5a97df9-28c8-4c8d-a2cf-7a6af54b6f1c" -> (known after apply)
      [33m~[0m[0m resource_group_name = "shir-dev-shir-rg" [33m->[0m[0m "myshir-dev-shir-rg" [31m# forces replacement[0m[0m
        tags                = {
            "workload" = "shir-runners"
        }
      [33m~[0m[0m tenant_id           = "37963dd4-f4e6-40f8-a7d6-24b97919e452" -> (known after apply)
        [90m# (1 unchanged attribute hidden)[0m[0m
    }

[1mPlan:[0m 17 to add, 0 to change, 14 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>